books/app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

  def edit
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 23)

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("image_url", "updated_at", "title", "copyright_year", "author_id", "publisher_id", "created_at") VALUES('http://laikasys.com/images/logo_50.png', '2010-04-13 06:25:00', 'My First Book', 1975, 1, NULL, '2010-04-13 06:25:00')

  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)
UPDATE "books" SET "author_id" = 2, "title" = 'My First Book2', "updated_at" = '2010-04-16 03:14:34' WHERE "id" = 1

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT * FROM "books" WHERE ("books"."id" = 2)
DELETE FROM "books" WHERE "id" = 2